export const VALIDATE_ERRORS = {
  nameError: 'Неверное имя: первая буква должна быть заглавной, без пробелов, допустим символ "-"',
  loginError: 'Неверный логин: не менее 3-х и не более 20-ти символов, латиница, допустимы символы "-" и "_"',
  emailError: 'Неверный email: латиница, допустимы символы "-" и "_", должна быть «@»',
  passwordError: 'Неверный пароль: от 8 до 40 символов, хотя бы одна заглавная буква и цифра',
  phoneError: 'Неверный телефон: от 10 до 15 символов, состоит из цифр, может начинается с +',
  messageError: 'Неверное сообщение: не должно быть пустым',
  submitError: 'Ошибка валидации. Проверьте корректность введенных даннных!',
  comparePasswordError: 'Введенные пароли не совпадают!'
}
